{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "Image"}, "name": "Image", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.image.resize_2", "trainable": true, "dtype": "float32", "function": "image.resize"}, "name": "tf.image.resize_2", "inbound_nodes": [["Image", 0, 0, {"size": [1024, 1024]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.image.extract_patches_2", "trainable": true, "dtype": "float32", "function": "image.extract_patches"}, "name": "tf.image.extract_patches_2", "inbound_nodes": [["tf.image.resize_2", 0, 0, {"sizes": [1, 128, 128, 1], "strides": [1, 128, 128, 1], "rates": [1, 1, 1, 1], "padding": "VALID"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.reshape_2", "trainable": true, "dtype": "float32", "function": "reshape"}, "name": "tf.reshape_2", "inbound_nodes": [["tf.image.extract_patches_2", 0, 0, {"shape": [1, -1, 49152]}]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["tf.reshape_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_2", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_2", "inbound_nodes": [["dense_2", 0, 0, {"y": [[-0.018061183393001556, 0.035026777535676956, 0.010665606707334518, 0.043797317892313004, -0.049728572368621826, 0.004734337329864502, 0.032083023339509964, -0.0010265335440635681, -0.005338452756404877, 0.047229792922735214, -0.036666225641965866, 0.01309208944439888, 0.040851835161447525, 0.0008278600871562958, -0.01639590412378311, 0.04849126562476158, -0.019997501745820045, -0.0005494728684425354, 0.006717968732118607, 0.02546527609229088, -0.030987108126282692, 0.01340467855334282, -0.031907640397548676, 0.025462571531534195, -0.03700746223330498, 0.027187082916498184, -0.0065579041838645935, 0.01163332536816597, 0.026747312396764755, 0.024181518703699112, 0.014945577830076218, -0.044356610625982285, 0.040510620921850204, 0.04554412141442299, -0.0021585002541542053, -0.010946832597255707, -0.005003653466701508, -0.04316096380352974, 0.023890528827905655, -0.04052429273724556, -0.014061607420444489, -0.006738018244504929, 0.016425523906946182, 0.005633760243654251, -0.04954873397946358, 0.04035041108727455, 0.012295365333557129, -0.031182659789919853, 0.004068158566951752, 0.006204284727573395, 0.008653484284877777, 0.04106361046433449, -0.025478852912783623, 0.01715928688645363, 0.013566222041845322, 0.04234865680336952, -0.04333200678229332, -0.034204233437776566, -0.016950178891420364, -0.038343511521816254, -0.020645666867494583, 0.01910027489066124, 0.02968759462237358, -0.02636817656457424], [0.026781287044286728, -0.03076578490436077, 0.020322982221841812, 0.018226314336061478, 0.028340470045804977, -0.03460758924484253, -0.028454864397644997, -0.0006633512675762177, -0.036417532712221146, 0.03194529935717583, 0.044135916978120804, -0.002804446965456009, 0.03424713388085365, -0.007815051823854446, 0.021889913827180862, 0.02779426798224449, -0.046681880950927734, 0.006465781480073929, -0.03206147998571396, 0.033625971525907516, 0.006778489798307419, 0.038490939885377884, 0.011704206466674805, 0.02109544351696968, 0.031740736216306686, 0.04520845785737038, -0.03789656236767769, -0.02974388562142849, -0.015530072152614594, 0.01807442680001259, 0.0006404407322406769, 0.006085194647312164, -0.026828110218048096, 0.048862602561712265, 0.03378831222653389, -0.04484865814447403, 0.03697272762656212, -0.02001870982348919, -0.012010812759399414, 0.04364212974905968, 0.015257012099027634, 0.0019497759640216827, -0.03535330295562744, 0.048352982848882675, -0.04002014547586441, 0.03423774614930153, -0.0050678737461566925, 0.02961726114153862, 0.019238818436861038, 0.04789874330163002, -0.0017234459519386292, 0.032244179397821426, 0.009158600121736526, -0.006916772574186325, 0.009140372276306152, 0.045648518949747086, 0.01930338516831398, -0.01839650794863701, 0.0011948347091674805, 0.02682453766465187, 0.02935904636979103, -0.03054908476769924, 0.010709427297115326, -0.009194206446409225], [-0.015874993056058884, -0.03576167672872543, 0.031242836266756058, 0.0060880668461322784, 0.02163689211010933, 0.04385656490921974, 0.018227506428956985, -0.002003096044063568, -0.049138475209474564, -0.01297982782125473, -0.03486015647649765, -0.00029522180557250977, 0.027506936341524124, 0.026971403509378433, -0.007393993437290192, -0.0075624361634254456, 0.0303475521504879, -0.006269432604312897, 0.01606300100684166, -0.035346925258636475, -0.010259710252285004, 0.014238368719816208, 0.031153012067079544, -0.04069108888506889, -0.0019138939678668976, 0.013364817947149277, 0.02885068580508232, -0.0330461747944355, 0.049962613731622696, 0.033829692751169205, -0.018928254023194313, 0.046636033803224564, -0.020654428750276566, -0.047616638243198395, -0.001988697797060013, -0.0398934967815876, -0.021825267001986504, 0.013317395001649857, -0.01060420274734497, -0.026064038276672363, 0.04413733258843422, 0.00769275426864624, 0.022057268768548965, 0.03993668779730797, 0.03828910365700722, 0.02128012105822563, -0.0110679492354393, 0.007597159594297409, -0.03257538378238678, 0.020743612200021744, 0.02727624401450157, -0.029103292152285576, 0.006765939295291901, 0.016141299158334732, 0.024515751749277115, -0.037889838218688965, -0.02189617231488228, -0.006058026105165482, 0.038905154913663864, -0.011441469192504883, -0.0015234127640724182, 0.03737432882189751, 0.023568976670503616, -0.03709319978952408], [0.0417320616543293, 0.009642113000154495, -0.04846956953406334, 0.00019626691937446594, 0.014677096158266068, -0.02028203010559082, -0.03894144296646118, -0.03477933257818222, 0.03865206614136696, -0.001661442220211029, -0.00869368389248848, -0.0462159626185894, 0.040570925921201706, -0.006263364106416702, -0.0454803965985775, 0.03461791202425957, -0.022094368934631348, -0.00964266061782837, 0.025677848607301712, -0.0060379281640052795, 0.006891369819641113, -0.03738129138946533, 0.04239990934729576, -0.011200390756130219, 0.048102427273988724, 0.021207299083471298, 0.016344938427209854, -0.04028473049402237, -0.01366407796740532, 0.02211036905646324, 0.04597068950533867, -0.0008220449090003967, 0.012206517159938812, 0.01868065819144249, 0.03353600576519966, -0.031888365745544434, -0.011848293244838715, 0.006799209862947464, -0.009667109698057175, 0.013364780694246292, -0.03178705275058746, -0.0058561451733112335, -0.008180774748325348, -0.014125991612672806, -0.020197749137878418, 0.01594683900475502, -0.020306481048464775, 0.020286474376916885, 0.044594358652830124, 0.025909509509801865, 0.019993852823972702, -0.0023622997105121613, -0.019513463601469994, -0.011746369302272797, -0.011745989322662354, 0.049318958073854446, -0.0016786567866802216, 0.007774807512760162, 0.018333401530981064, -0.017179179936647415, 0.031027089804410934, 0.028413090854883194, -0.022203518077731133, 0.002884186804294586], [0.020577218383550644, -0.037628185003995895, -0.048501383513212204, -0.03252176195383072, 0.004533253610134125, 0.02261069044470787, 0.04552597180008888, 0.009405922144651413, 0.042260799556970596, -0.014949478209018707, 0.011280335485935211, 0.02640766277909279, -0.03480083867907524, 0.03062589094042778, 0.018891606479883194, 0.026551809161901474, -0.041864216327667236, -0.013659287244081497, 0.02362874522805214, -0.03692818805575371, 0.01220763847231865, -0.0011332407593727112, 0.033855605870485306, -0.004423011094331741, 0.03936723247170448, 0.003006409853696823, 0.04887484386563301, -0.028100645169615746, 0.04207282140851021, -0.03165078163146973, 0.006104934960603714, -0.046881068497896194, -0.03082665242254734, -0.004783164709806442, -0.01101391389966011, 0.03387470170855522, -0.020374739542603493, 0.015647683292627335, -0.036972224712371826, 0.030730251222848892, 0.03638963773846626, -7.474422454833984e-05, 0.011107422411441803, -0.024210965260863304, 0.0007115378975868225, 0.036946047097444534, -0.007016908377408981, -0.033303357660770416, 0.001280568540096283, -0.029789471998810768, 0.01990072801709175, -0.04348557069897652, -0.028858793899416924, -0.013420235365629196, -0.009224258363246918, 0.03353924676775932, -0.0361565463244915, -0.031484056264162064, -0.04456445202231407, -0.03927807882428169, 0.026969339698553085, -0.04628806188702583, 0.011077500879764557, -0.019383752718567848], [0.0224427692592144, 0.02572624757885933, 0.03551800176501274, 0.005327951163053513, 0.018828798085451126, 0.042211953550577164, -0.007215011864900589, -0.0008735284209251404, -0.020320022478699684, 0.0034455545246601105, -0.03911560773849487, 0.034676019102334976, 0.03964823856949806, 0.026823867112398148, 0.0006249658763408661, 0.024391021579504013, -0.03634561225771904, 0.038775552064180374, 0.01934225484728813, -0.03803817182779312, -0.040240753442049026, -0.041573666036129, 0.014815140515565872, 0.03031155839562416, 0.016509104520082474, -0.005975890904664993, -0.023408735170960426, -0.02645636908710003, 0.026944030076265335, 0.023097362369298935, -0.04925011470913887, 0.0018652677536010742, -0.006764531135559082, -0.03358476236462593, 0.021578345447778702, -0.007323622703552246, 0.022254955023527145, 0.04760335758328438, -0.015439022332429886, 0.004435978829860687, 0.021535683423280716, -0.014114044606685638, 0.025910984724760056, 0.04557131603360176, 0.0293455608189106, 0.04619518294930458, -0.03091757372021675, 0.017260108143091202, -0.04165450483560562, 0.004916977137327194, 0.048781994730234146, -0.011091865599155426, -0.013812195509672165, 0.026687216013669968, 0.037949252873659134, 0.011364806443452835, 0.023415397852659225, -0.03745139762759209, -0.014053702354431152, -0.02655080519616604, -0.0008896812796592712, -0.008542489260435104, 0.021976184099912643, -0.0062964558601379395], [-0.02211000956594944, 0.04538853093981743, 0.015842650085687637, 0.008637022227048874, 0.04067036882042885, 0.007336877286434174, -0.004506874829530716, -0.03597981855273247, 0.03811540827155113, -0.020127570256590843, -0.040376804769039154, -0.02955249510705471, -0.014543138444423676, -0.00867842510342598, -0.04430270195007324, -0.04222602769732475, -0.04055464267730713, 0.014032449573278427, -0.018894493579864502, -0.039223410189151764, -0.028341174125671387, -0.04312526062130928, 0.027603451162576675, -0.002758670598268509, -0.013600658625364304, -0.04195408895611763, -0.008702300488948822, 0.0145333893597126, 0.04939169064164162, -0.004133842885494232, -0.04702714830636978, 0.0319332592189312, 0.029183734208345413, 0.009232819080352783, 0.010449610650539398, 0.013216841965913773, -0.022584546357393265, 0.0013813264667987823, 0.007054079324007034, 0.025073859840631485, -0.001975215971469879, 0.03946549817919731, -0.049211978912353516, -0.007767725735902786, -0.007237769663333893, 0.01143193244934082, -0.038999415934085846, 0.011124469339847565, -0.026620222255587578, 0.04846317693591118, 0.0289984829723835, 0.024856295436620712, -0.02815340831875801, 0.048818815499544144, 0.013670910149812698, 0.03658348694443703, 0.03656551614403725, -0.02974780835211277, 0.02222466841340065, -0.04154006391763687, -0.04137762635946274, -0.00186234712600708, 0.02754754200577736, -0.019313275814056396], [0.020056139677762985, 0.004294265061616898, -0.047859061509370804, -0.04963649436831474, 0.0033280029892921448, -0.006290137767791748, 0.022281061857938766, 0.011908136308193207, -0.0014948025345802307, 0.023164454847574234, 0.006727956235408783, 0.030842389911413193, -0.03466595336794853, 0.023830879479646683, -0.04589688777923584, -0.0333118811249733, 0.016639206558465958, -0.013835858553647995, -0.04247797653079033, 0.0230218805372715, -0.005146481096744537, 0.007295679301023483, -0.04289291054010391, -0.021731270477175713, -0.00496363639831543, -0.029272127896547318, 0.006882689893245697, -0.04732983186841011, -0.043917179107666016, -0.02635037899017334, -0.03323153406381607, 0.033670876175165176, 0.03519511595368385, -0.04600163921713829, -0.026059329509735107, -0.009154390543699265, 0.025065753608942032, 0.03998697176575661, -0.02313845232129097, 0.02018025889992714, 0.011723805218935013, -0.041120994836091995, -0.02817990817129612, -0.02304152213037014, -0.03252533823251724, 0.018118146806955338, -0.04976549372076988, 0.025419805198907852, 0.026506293565034866, 0.03016648069024086, -0.046262431889772415, -0.03807270526885986, -0.027351772412657738, 0.025653962045907974, 0.013034764677286148, 0.008481550961732864, 0.030154813081026077, -0.026074325665831566, -0.0034268274903297424, -0.028221523389220238, -0.03837614133954048, 0.027972687035799026, -0.03030679188668728, 0.012643706053495407], [-0.022470032796263695, -0.011294521391391754, -0.04753170162439346, 0.035821642726659775, -0.005693007260560989, -0.011236835271120071, 0.0024178624153137207, 0.012698221951723099, 0.027698900550603867, -0.030807053670287132, -0.028167081996798515, -0.024943530559539795, -0.014653883874416351, -0.017658889293670654, 0.020744990557432175, 0.023998502641916275, -0.006275355815887451, 0.04778382554650307, 0.025678042322397232, 0.0033080577850341797, -0.02789304219186306, -0.021113967522978783, 0.013121593743562698, 0.02834964171051979, -0.03482417017221451, -0.0017237290740013123, -0.04833180829882622, -0.04338287189602852, 0.008572150021791458, 0.01818211004137993, -0.02336256578564644, 0.03967214748263359, 0.03184005245566368, 0.004743136465549469, -0.013219989836215973, 0.009240996092557907, 0.03168659284710884, 0.022643987089395523, -0.029831016436219215, -0.04893798753619194, 0.0037354230880737305, 0.03239288553595543, -0.012049663811922073, 0.01739097759127617, -0.015283919870853424, 0.013754550367593765, 0.03737148270010948, 0.042432475835084915, -0.0009574182331562042, 0.04145875945687294, -0.010365106165409088, 0.03914710506796837, -0.0068032145500183105, -0.04880340024828911, 0.034096185117959976, -0.011442996561527252, 0.025664571672677994, 0.04207726940512657, -0.040068626403808594, -0.012149572372436523, -0.013510536402463913, -0.012669004499912262, -0.02860121801495552, -0.022141456604003906], [0.04659116640686989, -0.01865353435277939, 0.010938417166471481, -0.003625035285949707, -0.03325752168893814, 0.043836068361997604, -0.023632192984223366, -0.013066209852695465, -0.0029374584555625916, 0.04782721772789955, 0.04253319278359413, -0.0016564726829528809, -0.01885331980884075, 0.010428357869386673, 0.027683880180120468, -0.013118349015712738, 0.003623317927122116, 0.00885472446680069, 0.04341956600546837, 0.03329845890402794, -0.02930375374853611, 0.0013038404285907745, -0.015406440943479538, 0.0494893454015255, 0.0025161392986774445, -0.02815108373761177, -0.035045087337493896, 0.024065885692834854, -0.04591478034853935, -0.032582033425569534, -0.014261089265346527, 0.03610457107424736, 0.03102189674973488, -0.0010029561817646027, -0.03541773557662964, -0.006604135036468506, 0.004552982747554779, 0.029819142073392868, 0.03588003292679787, -0.009106911718845367, 0.003191102296113968, 0.03797497972846031, -0.037200190126895905, -0.0013446100056171417, 0.02292630448937416, 0.04692121967673302, -0.009304642677307129, -0.032252050936222076, 0.020370330661535263, -0.03870577737689018, -0.015197813510894775, -0.0022351518273353577, 0.04106980934739113, 0.04669675603508949, -0.03477632999420166, -0.04959188774228096, 0.00939244031906128, -0.03872925043106079, 0.03994988277554512, -0.026547718793153763, -0.015482734888792038, -0.017551947385072708, -0.008098412305116653, -0.019256591796875], [-0.02440204657614231, 0.017115604132413864, -0.03721768781542778, 0.007301904261112213, -0.0010859593749046326, -0.04571440443396568, 0.005387771874666214, -0.04614539071917534, 0.047952067106962204, -0.03378855064511299, 0.017112884670495987, 0.045399438589811325, 0.033317361027002335, 0.04884059354662895, 0.005246877670288086, 0.01891298219561577, 0.013873908668756485, 0.015348207205533981, 0.005522262305021286, -0.03566746786236763, 0.03183560445904732, 0.037385109812021255, -0.007640887051820755, 0.0387018658220768, 0.009447384625673294, 0.0024889223277568817, 0.04773557558655739, -0.028764069080352783, -0.03319749981164932, 0.043570052832365036, -0.009233377873897552, -0.03369881212711334, 0.019006002694368362, -0.022600555792450905, 0.019654635339975357, 0.007217369973659515, -0.030028700828552246, -0.034386537969112396, 0.04543354734778404, 0.0036449432373046875, 0.004539024084806442, 0.012474142014980316, 0.03458503261208534, 0.0015601292252540588, 0.039221931248903275, 0.020848874002695084, -0.01865009218454361, -0.008907973766326904, -0.043604280799627304, -0.03265448659658432, 0.04041330888867378, -0.02584623172879219, -0.030578196048736572, -0.032280661165714264, -0.011094726622104645, 0.0058664195239543915, 0.006467234343290329, -0.04582797363400459, -0.008285187184810638, 0.008457280695438385, 0.019098665565252304, 0.022053029388189316, 0.035512279719114304, 0.026496555656194687], [-0.04465227201581001, 0.04020829126238823, 0.017453398555517197, 0.04753968492150307, 0.036097053438425064, -0.023778332397341728, 0.049530718475580215, 0.008844852447509766, -0.009959042072296143, 0.029365431517362595, 0.00023911148309707642, -0.02474299632012844, -0.035917915403842926, 0.03738090768456459, -0.03595632314682007, -0.021186817437410355, -0.004752852022647858, 0.041721079498529434, -0.04520747810602188, -0.011046729981899261, -0.039224278181791306, 0.014245759695768356, 0.002613198012113571, -0.024960076436400414, -0.012270200997591019, -0.04341932758688927, 0.025781642645597458, -0.030753744766116142, 0.03741741552948952, -0.022507835179567337, -0.04915308952331543, 0.03090522065758705, -0.024301135912537575, -0.016417790204286575, -0.02882605791091919, 0.039350997656583786, -0.034948743879795074, -0.024074459448456764, 0.04413462057709694, -0.043030526489019394, 0.02295145019888878, 0.019751835614442825, -0.04717904329299927, 0.037795256823301315, -0.007653284817934036, -0.04098290205001831, 0.024396035820245743, -0.043120600283145905, -0.04042791202664375, -0.0007023923099040985, 0.0009414330124855042, 0.018673602491617203, 0.01910126581788063, 0.035211313515901566, -0.00592494010925293, 0.03662247583270073, 0.04678834602236748, 0.04658106341958046, -0.030885910615324974, -0.014264784753322601, -0.03945052623748779, -0.02031651698052883, 0.00479058176279068, -0.04938879236578941], [0.04187924787402153, -0.03764805942773819, 0.011669553816318512, 0.042691539973020554, 0.04148104414343834, 0.034819986671209335, 0.049740020185709, -0.04142826795578003, -0.011708211153745651, -0.019776536151766777, -0.02593149058520794, 0.0017495043575763702, 0.03238232061266899, 0.046048711985349655, 0.017970789223909378, -0.0008600354194641113, -0.046532630920410156, 0.04558007791638374, -0.0229118000715971, -0.007240414619445801, 0.018748175352811813, 0.022168193012475967, -0.03496534749865532, 0.0032263509929180145, 0.010875452309846878, -0.008306454867124557, -0.015154372900724411, 0.01625976338982582, -0.008935056626796722, -0.04422108083963394, 0.03924879804253578, -0.026967037469148636, 0.028189312666654587, 0.016451183706521988, -0.01573166996240616, -0.005384005606174469, -0.014719676226377487, -0.003348149359226227, -0.044941093772649765, 0.0011104941368103027, -0.001460827887058258, 0.0011921040713787079, -0.02689671516418457, 0.0468502976000309, 0.021957945078611374, -0.04133375734090805, -0.03468955680727959, 0.021981190890073776, -0.04366195201873779, 0.006799150258302689, -0.0296473391354084, -0.0021058693528175354, 0.04707814380526543, 0.02267206832766533, -0.027088606730103493, 0.021132294088602066, 0.030014965683221817, 0.02039453759789467, 0.030926715582609177, -0.042564716190099716, 0.021970126777887344, -0.013892628252506256, -0.01130681112408638, -0.04448864609003067], [0.033326197415590286, 0.014981333166360855, 0.027148019522428513, 0.030026722699403763, 0.03432461991906166, 0.008266806602478027, 0.02981105074286461, 0.02405766025185585, 0.027956198900938034, -0.012783955782651901, -0.017273664474487305, -0.004759311676025391, 0.016285110265016556, -0.03072754107415676, 0.03553226962685585, -0.03680207580327988, -0.0447809211909771, -0.011356722563505173, 0.008507180958986282, -0.02219601906836033, -0.0007231719791889191, -0.040097881108522415, -0.000567995011806488, 0.004078555852174759, -0.01878972165286541, 0.03135908022522926, 0.04009157791733742, 0.039048437029123306, 0.03926132991909981, -0.048390913754701614, 0.03930633142590523, 0.03993338719010353, -0.026466894894838333, 0.04504140838980675, 0.029254022985696793, 0.025457587093114853, -0.0008264780044555664, 0.047585178166627884, 0.0281204916536808, -0.043183039873838425, 0.04143152013421059, -0.02521371841430664, -0.04589818790555, -0.036720264703035355, 0.02078218385577202, 0.046263743191957474, -0.0013353340327739716, -0.03498850017786026, -0.04852014780044556, 0.013822901993989944, 0.023226309567689896, 0.043651510030031204, -0.020220471546053886, -0.02651798725128174, -0.04085952043533325, 0.010489236563444138, -0.01752229779958725, 0.041674066334962845, -0.033977486193180084, 0.017760489135980606, 0.003183472901582718, -0.019717002287507057, 0.034479591995477676, 0.005846463143825531], [-0.03270721435546875, 0.01080700010061264, -0.037709545344114304, -0.048803653568029404, 0.028188418596982956, 0.016257215291261673, -0.021539736539125443, 0.035461533814668655, -0.04021499305963516, 0.0017379410564899445, -0.0142885223031044, 0.00794602558016777, -0.03705962747335434, 0.025737356394529343, 0.035409558564424515, 0.013506021350622177, 0.02603936567902565, -0.014539945870637894, 0.00426865741610527, 0.017435166984796524, -0.049524009227752686, 0.029276419430971146, 0.0474705807864666, -0.005946896970272064, -0.0024129264056682587, -0.028389131650328636, -0.049096811562776566, -0.012880086898803711, -0.003939010202884674, -0.02320849895477295, 0.004314742982387543, 0.023995231837034225, 0.010795772075653076, -0.03508488088846207, 0.04956250265240669, -0.045271873474121094, -0.006541609764099121, 0.01957717165350914, -0.0186411514878273, 0.0022190697491168976, -0.02941267564892769, 0.025809016078710556, -0.010487116873264313, -0.004014350473880768, 0.019572291523218155, 0.011019397526979446, 0.043796245008707047, 0.017388198524713516, -0.04132883623242378, 0.02758720889687538, 0.02844366803765297, -0.003851544111967087, -0.043025482445955276, 0.03160588815808296, -0.03797545284032822, -0.0017167441546916962, -0.01676245778799057, -0.02939091995358467, -0.031659722328186035, -0.008593808859586716, -0.032887235283851624, 0.008817888796329498, 0.04010060802102089, -0.04162830114364624], [0.03952563926577568, -0.022762848064303398, -0.012382518500089645, -0.035191237926483154, -0.030638743191957474, -0.021206725388765335, 0.04145728424191475, 0.032560717314481735, -0.020399808883666992, -0.03970068693161011, 0.034326184540987015, -0.005807004868984222, -0.0031108856201171875, 0.03876538202166557, -0.00772181898355484, -0.014594756066799164, -0.012866400182247162, 0.047538843005895615, 0.04601113870739937, 0.031668249517679214, 0.001592971384525299, -0.04006870836019516, 0.021150995045900345, 0.0482887364923954, -0.04130743816494942, 0.021165791898965836, 0.026691947132349014, -0.04449082538485527, -0.002898644655942917, -0.028033817186951637, -0.021652257069945335, -0.03357286751270294, 0.027535509318113327, -0.04054756090044975, -0.03648374229669571, -0.03143588453531265, 0.017535533756017685, -0.028680134564638138, -0.01990356482565403, -0.04617056995630264, 0.03764725103974342, 0.019562963396310806, 0.038374487310647964, -0.018462859094142914, -0.01773371547460556, 0.02920723333954811, -0.003705643117427826, -0.028996741399168968, 0.0014526620507240295, 0.025829318910837173, -0.0015856139361858368, -0.029195809736847878, -0.041680194437503815, -0.008463453501462936, -0.023442352190613747, -0.047417428344488144, -0.03288626670837402, 0.012722019106149673, 0.03841295465826988, 0.02051560953259468, -0.0065887197852134705, -0.043360866606235504, -0.025707829743623734, -0.0002933517098426819], [-0.042715419083833694, 0.02681705728173256, 0.047734584659338, -0.04531644657254219, 0.009526025503873825, -0.00392146036028862, 0.00616532564163208, 0.021121691912412643, -0.03403794765472412, 0.008742701262235641, -0.01498434692621231, -0.0029740333557128906, -0.009980417788028717, -0.013220764696598053, 0.043646249920129776, 0.04579034075140953, 0.021042611449956894, -0.030939793214201927, -0.04456055164337158, 0.024962972849607468, 0.03170290216803551, 0.04098090901970863, -0.0176423080265522, -0.04290511831641197, -0.04768716171383858, 0.04817552492022514, 0.02999972179532051, 0.03009260818362236, -0.002910017967224121, 0.025752630084753036, -0.04023491218686104, -0.012434016913175583, 0.04562162235379219, 0.030335579067468643, -0.009857177734375, 0.021359693259000778, -0.03949861600995064, 0.0001130811870098114, 0.0031723752617836, -0.013740621507167816, -0.04631216451525688, 0.020377282053232193, 0.014713894575834274, -0.0030965209007263184, -0.012798428535461426, 0.040576208382844925, -0.022149277850985527, -0.029015077278017998, -0.026804018765687943, 0.028331663459539413, 0.003913532942533493, -0.03959169238805771, 0.010899294167757034, -0.043879974633455276, 0.01103353500366211, -0.00802469253540039, 0.007676482200622559, -0.03650627285242081, 0.007566999644041061, 0.018757212907075882, -0.0417376384139061, 0.04222777113318443, 0.029667768627405167, 0.0010270476341247559], [0.014164377003908157, 0.04853321239352226, 0.023406241089105606, -0.03423692286014557, -0.04431840404868126, 0.021140705794095993, -0.030026257038116455, 0.008191179484128952, 0.007481731474399567, 0.0015390627086162567, -0.011564932763576508, -0.014640308916568756, 0.03176088258624077, 0.01573904976248741, 0.026871133595705032, -0.04552788659930229, -0.028923917561769485, -0.046872686594724655, 0.034384217113256454, 0.006641160696744919, -0.04848266765475273, 0.030321922153234482, 0.03531075641512871, 0.0227956660091877, -0.03727041557431221, -0.02524777688086033, 0.043366674333810806, -0.003796745091676712, -0.016068924218416214, 0.013729605823755264, -0.008597888052463531, 0.02102437987923622, -0.04016122967004776, 0.003976453095674515, 0.007820941507816315, -0.011109866201877594, 0.0059030428528785706, 0.04920889064669609, -0.04548574611544609, 0.002571903169155121, 0.029765669256448746, 0.006108902394771576, -0.039798248559236526, 0.024807263165712357, -0.0270440224558115, -0.009143196046352386, -0.00435715913772583, -0.03574289008975029, -0.0064030662178993225, -0.022095918655395508, -0.04795711115002632, 0.025536034256219864, 0.03425408527255058, 0.014189805835485458, 0.008664917200803757, -0.028713703155517578, -0.019222093746066093, -0.009269751608371735, 0.026980403810739517, -0.022674525156617165, 0.03952084854245186, 0.00020410865545272827, 0.0008739456534385681, -0.0323384553194046], [-0.009219609200954437, -0.016993723809719086, -0.00030480697751045227, 0.015183817595243454, -0.02000727690756321, -0.04422561079263687, -0.048842739313840866, 0.04933607950806618, -0.04549449682235718, 0.04588044807314873, -0.024392331019043922, 0.02239224687218666, -0.014699019491672516, 0.02018289640545845, -0.033938098698854446, 0.016011204570531845, 0.006962109357118607, 0.033563945442438126, -0.025152159854769707, -0.014801491051912308, -0.041063714772462845, -0.021288538351655006, 0.0019291527569293976, -0.0024086013436317444, -0.04841291904449463, 0.015609059482812881, 0.03505653515458107, -0.008719373494386673, -0.03673649951815605, -0.044858720153570175, 0.04627532884478569, 0.03659367933869362, 0.0176369808614254, 0.0038055405020713806, -0.029141772538423538, -0.01692713424563408, -0.04532217979431152, 0.0021964311599731445, 0.013980459421873093, 0.04309122636914253, 0.018738124519586563, 0.025247681885957718, -0.005034066736698151, -0.0034704431891441345, -0.048397231847047806, -0.047068964689970016, -0.006494034081697464, -0.04529324918985367, -0.03208198398351669, -0.04228698089718819, -0.04011810943484306, 0.04533899948000908, 0.013027671724557877, 0.004522182047367096, 0.039645005017519, -0.011494945734739304, -0.030114805325865746, -0.019726073369383812, 0.04012871906161308, 0.022771839052438736, -0.0009325034916400909, -0.025904322043061256, -0.029277635738253593, 0.04220609739422798], [-0.020682895556092262, 0.036971721798181534, 0.0007228478789329529, -0.0411534309387207, -0.02644442394375801, 0.025753501802682877, 0.04445992782711983, -0.03328973054885864, -0.029835736379027367, -0.02058178186416626, 0.03852193430066109, 0.04723255708813667, 0.040320802479982376, 0.026940058916807175, 0.03218938037753105, 0.031261514872312546, 0.015851188451051712, -0.010360024869441986, 0.04917558655142784, -0.007573425769805908, 0.020286645740270615, 0.004864048212766647, -0.010041404515504837, -0.021442580968141556, 0.047594692558050156, 0.03106161579489708, -0.044279586523771286, -0.012007664889097214, 0.03765139356255531, -0.022398317232728004, -0.00140298530459404, 0.04713297262787819, -0.03270788490772247, -0.014967788010835648, 0.01684851571917534, 0.03391839191317558, 0.0016934163868427277, 0.009320199489593506, -0.031204700469970703, -0.013046003878116608, 0.049337614327669144, 0.032259751111269, 0.015682030469179153, -0.013168074190616608, 0.007307626307010651, -0.03914245218038559, -0.00788569450378418, 0.0028882138431072235, -0.0026588812470436096, 0.006804086267948151, 0.01935991272330284, 0.026401665061712265, -0.03500467538833618, -0.046838391572237015, -0.020407570526003838, 0.021921996027231216, -0.0429794080555439, -0.046579696238040924, 0.03062155470252037, 0.03427254036068916, 0.029071751981973648, 0.0017639771103858948, 0.0392383448779583, -0.04163568094372749], [-0.04195021465420723, 0.0480361245572567, -0.022393787279725075, 0.012608837336301804, -0.03523977845907211, -0.02082422934472561, 0.028280626982450485, 0.04949181154370308, 0.03775516524910927, -0.010088551789522171, -0.010333061218261719, -0.003988254815340042, -0.025030160322785378, 0.009181223809719086, 0.03307563439011574, 0.04380190744996071, -0.029697036370635033, -0.012552522122859955, 0.0015500187873840332, 0.019436325877904892, 0.046754155308008194, -0.005552567541599274, -0.01973816193640232, -0.03343673050403595, 0.018737267702817917, 0.015543010085821152, -0.0241965651512146, -0.03954308107495308, 0.006872594356536865, 0.01597822830080986, -0.03254185989499092, 0.04809267446398735, 0.015899788588285446, -0.0008147135376930237, -0.017200041562318802, 0.03839868679642677, -0.0022014491260051727, 0.045673493295907974, 0.010730884969234467, 0.015766512602567673, 0.007457174360752106, -0.03189586475491524, 0.033446040004491806, 0.010034821927547455, -0.030448710545897484, 0.03260943666100502, 0.03325920179486275, 0.029696572571992874, 0.011882126331329346, 0.01904529705643654, 0.01781877502799034, 0.025201980024576187, 0.012093029916286469, 0.04088497534394264, 0.044818732887506485, 0.0030171163380146027, -0.04363163933157921, -0.022093355655670166, 0.04007405415177345, -0.017169155180454254, -0.03064795769751072, -0.03138653188943863, 0.02437836304306984, -0.01824720948934555], [-0.021861005574464798, 0.010507941246032715, 0.024580661207437515, -0.008939873427152634, 0.02082819864153862, -0.04966866970062256, 0.001975715160369873, 0.016447577625513077, 0.03013007715344429, -0.02759268321096897, 0.04862625524401665, -0.010900735855102539, -0.0014289729297161102, 0.027906503528356552, -0.04445170238614082, -0.030674636363983154, -0.016920138150453568, 0.04401833936572075, -0.009881902486085892, -0.007829807698726654, -0.03364552557468414, -0.03330730274319649, -0.00013768672943115234, -0.043071772903203964, 0.03978658840060234, -0.03304620087146759, 0.027020957320928574, 0.028407882899045944, -0.022576630115509033, -0.031620100140571594, 0.016599152237176895, 0.004492450505495071, 0.04623037949204445, -0.03502774238586426, -0.012083541601896286, -0.03768850490450859, -0.013981938362121582, 0.02821517363190651, -0.026495719328522682, 0.042908694595098495, 0.0228545181453228, 0.019603397697210312, 0.01780066266655922, -0.03293830156326294, -0.003611229360103607, 0.025266025215387344, -0.02848646603524685, 0.04303183779120445, -0.012238860130310059, -0.012242376804351807, -0.020213842391967773, -0.04565349966287613, -0.028068268671631813, 0.029185961931943893, 0.02565481886267662, -0.005672633647918701, -0.048690177500247955, 0.00759505107998848, 0.03245287016034126, -0.00973210483789444, 0.01148214191198349, 0.027659837156534195, 0.016138676553964615, 0.02144315466284752], [0.00814221054315567, 0.015785586088895798, 0.04323196783661842, 0.011358965188264847, 0.04675087705254555, 0.04843482747673988, 0.005482889711856842, 0.018643606454133987, 0.018114890903234482, -0.01622053235769272, -0.0416213758289814, -0.030867421999573708, -0.007128633558750153, 0.008593402802944183, 0.03435417637228966, 0.04715481773018837, 0.020274925976991653, 0.03720290586352348, 0.0030613765120506287, -0.031136691570281982, 0.02090427652001381, 0.009698320180177689, -0.036267150193452835, 0.04233640804886818, 0.02608419582247734, 0.045098114758729935, 0.023467015475034714, 0.025699090212583542, 0.02932678535580635, 0.04200373962521553, -0.019321216270327568, 0.02011357620358467, 0.02519075945019722, 0.0012012720108032227, -0.0026954635977745056, 0.01805983856320381, -0.034392379224300385, 0.008790232241153717, -0.026885509490966797, 0.019974935799837112, 0.017825331538915634, 0.04186533764004707, -0.044125236570835114, -0.04009890556335449, -0.018082737922668457, 0.003493059426546097, -0.017404746264219284, 0.026151243597269058, -0.02250802516937256, 0.02208555117249489, -0.026230348274111748, -0.022581815719604492, 0.018600676208734512, -0.014196645468473434, -0.016055691987276077, 0.02900555357336998, -0.036680638790130615, -0.013053297996520996, -0.04233044385910034, -0.027570044621825218, 0.00039000436663627625, -0.01615292951464653, 0.001497555524110794, -0.03833361715078354], [0.03035658970475197, -0.003982163965702057, 0.041140858083963394, 0.012763086706399918, -0.02921884134411812, -0.0407794713973999, -0.011694561690092087, 0.04783893749117851, 0.012355674058198929, -0.0370824821293354, 0.04155879095196724, -0.0030793920159339905, -0.01156555488705635, -0.02916823700070381, 0.013703834265470505, -0.02481057681143284, -0.004555545747280121, -0.0417218916118145, -0.026503730565309525, -0.014881957322359085, -0.021379411220550537, -0.03633686155080795, -0.04154016822576523, -0.04273125156760216, -0.010874368250370026, 0.028165366500616074, 0.034883905202150345, 0.0071442611515522, -0.017021358013153076, -0.012273609638214111, 0.03558364883065224, 0.027923714369535446, 0.038725946098566055, 0.02902017906308174, -0.036915265023708344, -0.013289906084537506, -0.03630957752466202, -0.012496661394834518, 0.011634327471256256, -0.023071682080626488, 0.01744108274579048, 0.03574434295296669, -0.0022106878459453583, 0.01822643354535103, 0.01042938232421875, -0.004462599754333496, -0.018405772745609283, 0.010006189346313477, -0.03559758514165878, 0.015689361840486526, 0.043023619800806046, -0.036969732493162155, 0.046524349600076675, -0.04163835197687149, 0.006783030927181244, 0.018306318670511246, 0.003880143165588379, -0.006419908255338669, 0.04145212098956108, 0.037085387855768204, -0.010251153260469437, 0.016659628599882126, -0.018560003489255905, -0.049022067338228226], [-0.008464597165584564, 0.01648620143532753, -0.004922579973936081, 0.04870882257819176, 0.034551892429590225, -0.020670056343078613, 0.02114555612206459, -0.006986487656831741, -0.02973964251577854, 0.00381624698638916, 0.03844271972775459, -0.01092534139752388, 0.012725535780191422, -0.03948694467544556, -0.030911637470126152, -0.03774159029126167, 0.021761957556009293, 0.01703028753399849, 0.03032081201672554, 0.0145256407558918, 5.7209283113479614e-05, -0.012952841818332672, -0.043360330164432526, -0.02257533185184002, -0.041878245770931244, 0.026314187794923782, -0.04343023523688316, -0.04680222272872925, 0.03377064689993858, 0.007235180586576462, 0.02890634909272194, 0.04972681775689125, 0.02510960027575493, 0.032158005982637405, -0.03884660080075264, -0.024985432624816895, -0.003261364996433258, 0.03583170101046562, -0.008230306208133698, 0.04104356840252876, -0.0015832893550395966, 0.005253888666629791, -0.01896744966506958, -0.034030161798000336, 0.012003492563962936, -0.0009062886238098145, -0.03926612064242363, -0.02069188468158245, -0.009738028049468994, -0.0177450068295002, 0.01171400398015976, 0.014138784259557724, 0.005858719348907471, 0.015264343470335007, -0.007071077823638916, -0.028833461925387383, -0.008688867092132568, -0.005858980119228363, -0.03003676049411297, -0.020856691524386406, -0.023767877370119095, 0.018873561173677444, -0.016459215432405472, 0.012301910668611526], [0.040106501430273056, 0.001849006861448288, -0.043740320950746536, -0.004544176161289215, 0.03607760742306709, -0.02080289088189602, -0.027784371748566628, 0.0017481222748756409, -0.009386338293552399, -0.024631215259432793, -0.028410255908966064, -0.030350780114531517, -0.04870407655835152, -0.019084548577666283, -0.029479099437594414, -0.04702455922961235, 0.03810631111264229, 0.048964571207761765, -0.012459766119718552, -0.0066469088196754456, 0.049334313720464706, -0.03649649769067764, -0.039239466190338135, 0.004204977303743362, 0.04835382476449013, -0.0035385116934776306, 0.01922180876135826, 0.01666814461350441, -0.004616189748048782, 0.049730125814676285, -0.015558529645204544, -0.0066737644374370575, -0.03357918560504913, 0.009131014347076416, 0.01855388656258583, -0.035941384732723236, 0.021709274500608444, -0.038281213492155075, -0.009704649448394775, -0.005424238741397858, 0.03005952015519142, 0.0046992674469947815, 0.037161145359277725, 0.0326511524617672, -0.004723440855741501, -0.008768368512392044, 0.047525856643915176, 0.0463838092982769, 0.040486183017492294, -0.0059437863528728485, 0.007614396512508392, 0.04616937413811684, 0.0173969529569149, -0.033050358295440674, -0.03490806743502617, 0.02993566170334816, 0.025981474667787552, 0.03601377084851265, -0.004244647920131683, -0.014456190168857574, -0.0029232725501060486, 0.009479321539402008, 0.001205693930387497, -0.005240894854068756], [0.030713412910699844, 0.04766244813799858, -0.04356471449136734, 0.022119928151369095, -0.04489392042160034, 0.005358446389436722, -0.04799274355173111, 0.011470865458250046, 0.04984719678759575, 0.01260359212756157, 0.007474660873413086, 0.025661472231149673, -0.0245490912348032, 0.026739347726106644, 0.04892801120877266, 0.04340566322207451, -0.036708712577819824, -0.04416130855679512, 0.012437663972377777, 0.00219566747546196, -0.003158044070005417, 0.012941088527441025, -0.031296491622924805, 0.03366515412926674, -0.01594819873571396, 0.01138671487569809, -0.0317225344479084, 0.021975044161081314, 0.015580717474222183, -0.0028056390583515167, -0.01537766307592392, -0.006860516965389252, 0.008453510701656342, 0.047014836221933365, 0.01771700754761696, 0.0011139512062072754, 0.027601171284914017, -0.019033158197999, -0.04353609308600426, -0.039214231073856354, 0.03483929857611656, 0.009003866463899612, -0.009278308600187302, -0.046562518924474716, -0.04272499307990074, -0.02917727269232273, -0.03148110210895538, -0.019717669114470482, -0.04268745332956314, -0.02524319849908352, 0.041338514536619186, 0.00290762260556221, -0.03224673122167587, 0.0183950774371624, 0.02745053544640541, 0.020169947296380997, -0.047277022153139114, -0.039398014545440674, 0.014983702450990677, -0.01300506666302681, -0.03333325684070587, 0.010669492185115814, -0.03635897487401962, -0.018013786524534225], [-0.0019245147705078125, 0.018647562712430954, -0.046966470777988434, 0.04598051682114601, -0.021783186122775078, -0.001872420310974121, -0.0404977910220623, -0.019211208447813988, -0.01649855449795723, 0.037685420364141464, 0.00313640758395195, 0.047819528728723526, 0.026963796466588974, 0.0007379651069641113, -0.004782486706972122, 0.004526268690824509, -0.021061791107058525, -0.014659188687801361, 0.006645727902650833, 0.04123002663254738, 0.0002638809382915497, 0.009481299668550491, 0.021750640124082565, -0.020500624552369118, 0.03435368463397026, -0.019408011808991432, -0.0013078823685646057, 0.012133311480283737, 0.03452961519360542, 0.04116660729050636, 0.0257258303463459, -0.0007591955363750458, 0.01637277379631996, 0.010283660143613815, 0.0349414236843586, -0.01644885540008545, -0.044700004160404205, 0.0017367228865623474, 0.030560199171304703, -0.02457219362258911, -0.028294695541262627, 0.025196578353643417, -0.024800075218081474, 0.04857896640896797, 0.015388574451208115, -0.020619332790374756, 0.03815964236855507, 0.03938020393252373, -0.012837670743465424, 0.04077932611107826, -0.010125827044248581, -0.039976976811885834, 0.04382406547665596, 0.01789816841483116, 0.03736138716340065, -0.040977418422698975, 0.010452471673488617, -0.04643125459551811, 0.02117607370018959, -0.04644650220870972, -0.01974513567984104, -0.03849514573812485, -0.03111906163394451, -0.04770028591156006], [-0.041169118136167526, 0.010117866098880768, -0.02253059111535549, -0.009825397282838821, -0.014169670641422272, -0.025563478469848633, 0.0019240379333496094, -0.010983802378177643, -0.04520916938781738, -0.04035092517733574, 0.017854098230600357, -0.015429534018039703, -0.028262769803404808, -0.017270304262638092, -0.044599439948797226, 0.022030461579561234, 0.017808470875024796, -0.034787487238645554, 0.04464756324887276, -0.04317575693130493, 0.032213661819696426, -0.04555467516183853, -0.008642695844173431, 0.047965262085199356, -0.017380546778440475, -0.027570581063628197, -0.04760777950286865, 0.005026388913393021, -0.04402527958154678, -0.018961621448397636, 0.013226937502622604, 0.0103827603161335, 0.012723837047815323, -0.01621067523956299, -0.03622112423181534, -0.0116630420088768, 0.042278897017240524, 0.04266918823122978, -0.029470670968294144, 0.013118457049131393, -0.047303881496191025, 0.03850105032324791, 0.034343842417001724, -0.01449805498123169, -0.02134845219552517, -0.049243807792663574, 0.03359398618340492, -0.014986313879489899, -0.045556165277957916, 0.011267900466918945, 0.01273440197110176, -0.015698492527008057, -0.03521077707409859, -0.020272089168429375, 0.04921560361981392, 0.018013063818216324, -0.0445711612701416, -0.04515676572918892, -0.012179531157016754, -0.011366616934537888, 0.039460550993680954, -0.016518402844667435, -0.017743505537509918, -0.0060708895325660706], [0.007989060133695602, 0.02950090542435646, 0.02357015386223793, 0.017413008958101273, 0.03131735697388649, -0.00845111533999443, -0.042304541915655136, 0.0017963871359825134, 0.03940489515662193, -0.009585164487361908, -0.007243931293487549, 0.02048596367239952, -0.0035940632224082947, 0.012837473303079605, -0.02928720787167549, -0.021701812744140625, -0.006746627390384674, -0.023832369595766068, 0.013966049998998642, 0.00954977422952652, -0.047267939895391464, 0.013232696801424026, 0.04502243176102638, 0.025689031928777695, 0.012041915208101273, -0.04404108598828316, 0.00234975665807724, -0.04292656108736992, -0.04153047874569893, 0.036093179136514664, 0.006677068769931793, 0.011669408529996872, 0.002575099468231201, 0.030677642673254013, 0.016890253871679306, -0.02414005994796753, -0.02282559871673584, 0.0275278203189373, 0.010596074163913727, -0.03428558260202408, 0.001055847853422165, -0.01660478115081787, 0.04212338104844093, 0.015499327331781387, 0.023410309106111526, -0.00578070804476738, 0.041345011442899704, 0.020238760858774185, -0.009918879717588425, 0.036322783678770065, 0.015614461153745651, -0.00021573156118392944, -0.013317476958036423, -0.031080735847353935, -0.0030653588473796844, -0.03756134584546089, -0.020249558612704277, -0.01884601078927517, 0.049736130982637405, -0.012552380561828613, -0.009181581437587738, 0.034983109682798386, 0.014827553182840347, -0.04625948891043663], [-0.013970792293548584, -0.049636270850896835, -0.028424179181456566, -0.046779513359069824, -0.035323478281497955, 0.029237661510705948, -0.024780118837952614, 0.04080977663397789, 0.01609576866030693, 0.0385969914495945, -0.038061488419771194, 0.008264206349849701, -0.0276090856641531, -0.020088959485292435, -0.010966729372739792, -0.008979462087154388, -0.04269878938794136, 0.015204157680273056, 0.039088476449251175, 0.005269836634397507, 0.028519894927740097, 0.010333813726902008, 0.017985749989748, -0.021307779476046562, 0.029335130006074905, 0.0009996183216571808, 0.008246410638093948, -0.006231904029846191, 0.010107289999723434, 0.0014424212276935577, -0.04880253225564957, 0.019214440137147903, -0.00985187292098999, -0.004208646714687347, -0.03023580275475979, 0.009692192077636719, -0.04159058257937431, -0.008731961250305176, -0.015901468694210052, -0.004848957061767578, -0.029842985793948174, 0.010083377361297607, -0.026691114529967308, 0.04893139377236366, -0.046680282801389694, 0.03638963773846626, 0.03538484498858452, -0.03470509126782417, -0.017231106758117676, 0.014632884413003922, 0.03126564249396324, -0.003333866596221924, -0.0009157173335552216, 0.02999427542090416, -0.008868731558322906, -0.022997558116912842, 0.008322060108184814, 0.0131460539996624, 0.015095006674528122, 0.030038107186555862, 0.0006353035569190979, -0.013855457305908203, -0.015481244772672653, -0.013256501406431198], [-0.013680923730134964, 0.04870214685797691, 0.03366278484463692, 0.044947076588869095, -0.03334599733352661, -0.026447534561157227, -0.02117183245718479, 0.03357325866818428, 0.01865902915596962, -0.03461966663599014, -0.04542744159698486, 0.014070216566324234, -0.03770475462079048, 0.048810962587594986, 0.03834036365151405, 0.004476677626371384, 0.04032459482550621, 0.002225209027528763, -0.010867871344089508, -0.04319591447710991, 0.0003258362412452698, 0.01625901833176613, -0.028345931321382523, -0.04392136260867119, 0.040808770805597305, -0.04669567570090294, 0.03826676681637764, -0.0031617656350135803, -0.03229868412017822, 0.039099741727113724, -0.028778744861483574, 0.042098138481378555, -0.015275120735168457, 0.00655808299779892, -0.01614365726709366, 0.023799564689397812, 0.036844875663518906, 0.005757175385951996, -0.047167014330625534, 0.021389532834291458, 0.0398540236055851, 0.028356585651636124, -0.013834215700626373, -0.041782937943935394, 0.021161247044801712, -0.029797887429594994, -0.012234114110469818, 0.031740594655275345, 0.04482176527380943, -0.019445836544036865, 0.005521655082702637, 0.023871805518865585, -0.032874979078769684, 0.008874393999576569, 0.03745967522263527, -0.009264659136533737, 0.007744967937469482, 0.005068492144346237, 0.03197716549038887, 0.022310111671686172, 0.04385775700211525, 0.014254186302423477, 0.011068202555179596, 0.00425652414560318], [0.03743242099881172, -0.023244906216859818, -0.042555104941129684, -0.02208157815039158, 0.043315041810274124, 0.01649225875735283, 0.04458064213395119, -0.01304476335644722, -0.005529142916202545, -0.004677571356296539, 0.04167034849524498, -0.005806170403957367, -0.0368606336414814, -0.0490400567650795, 0.04007960483431816, -0.011142492294311523, -0.03365377336740494, -0.010897684842348099, -0.0040059685707092285, -0.00641246885061264, -0.0010213255882263184, -0.03053724765777588, -0.013774357736110687, -0.03244810178875923, 0.039228882640600204, -0.048013925552368164, -0.04292948171496391, -0.020559120923280716, -0.015934862196445465, 0.02194516733288765, 0.00556250661611557, -0.0409763939678669, -0.04786646366119385, 0.04769061878323555, 0.03583941236138344, 0.0013301968574523926, -0.023365497589111328, -0.040570735931396484, 0.04109591618180275, 0.03162376955151558, 0.0047805532813072205, 0.008800648152828217, 0.012130558490753174, 0.03283277526497841, 0.0387321375310421, 0.025291625410318375, 0.04723680391907692, -0.004599202424287796, 0.02596067264676094, -0.035771261900663376, -0.04671582207083702, 0.0009320005774497986, 0.02631470188498497, 0.009051524102687836, 0.0003657229244709015, -0.049175430089235306, -0.008427701890468597, 0.030066777020692825, -0.034848712384700775, 0.03342771902680397, -0.012830175459384918, 0.03055662289261818, -0.007943429052829742, -0.009391892701387405], [-0.011246312409639359, 0.020578157156705856, -0.028339315205812454, -0.03891902044415474, 0.023423049598932266, 0.03974490240216255, -0.029617203399538994, 0.046129096299409866, 0.005634821951389313, 0.016607332974672318, -0.047303080558776855, -0.01742643117904663, 0.020323384553194046, 0.016885433346033096, 0.02556072548031807, 0.048316869884729385, -0.00040344148874282837, -0.006996225565671921, -0.0012504346668720245, 0.04434298351407051, 0.030131328850984573, 0.017125282436609268, 0.002091825008392334, -0.04470710828900337, -0.009445715695619583, 0.04563115909695625, 0.04506195709109306, -0.0250127911567688, -0.0015174373984336853, -0.030018150806427002, 0.03584626689553261, -0.034060195088386536, 0.026969823986291885, -0.02132253721356392, -0.0397760272026062, -0.014204300940036774, 0.03624400869011879, -0.03159135580062866, -0.0295081976801157, -0.04507267475128174, -0.0020871050655841827, 0.014424119144678116, 0.005574963986873627, -0.02453594282269478, -0.029151368886232376, 0.04619056358933449, 0.04105326905846596, -0.029182661324739456, 0.027041170746088028, -0.0038175582885742188, 0.014607038348913193, -0.02344963513314724, 0.03760937228798866, 